strimzi-demo-copia/src/infra/perf-results/02-producer-medium-messages.txt
5761 records sent, 1152.2 records/sec (1.13 MB/sec), 1506.8 ms avg latency, 2408.0 ms max latency.
31500 records sent, 6278.7 records/sec (6.13 MB/sec), 4342.8 ms avg latency, 5925.0 ms max latency.
46215 records sent, 9202.5 records/sec (8.99 MB/sec), 3747.8 ms avg latency, 4833.0 ms max latency.
68805 records sent, 13761.0 records/sec (13.44 MB/sec), 2681.8 ms avg latency, 3432.0 ms max latency.
140835 records sent, 28167.0 records/sec (27.51 MB/sec), 1165.8 ms avg latency, 1738.0 ms max latency.
500000 records sent, 16814.1 records/sec (16.42 MB/sec), 1627.40 ms avg latency, 5925.00 ms max latency, 923 ms 50th, 4607 ms 95th, 5548 ms 99th, 5881 ms 99.9th.