strimzi-demo-copia/src/infra/perf-results/03-producer-large-messages.txt
3078 records sent, 613.9 records/sec (5.99 MB/sec), 1800.5 ms avg latency, 2658.0 ms max latency.
4272 records sent, 853.9 records/sec (8.34 MB/sec), 2195.6 ms avg latency, 2948.0 ms max latency.
7083 records sent, 1415.8 records/sec (13.83 MB/sec), 1705.5 ms avg latency, 2932.0 ms max latency.
10023 records sent, 2004.6 records/sec (19.58 MB/sec), 1038.2 ms avg latency, 1685.0 ms max latency.
16313 records sent, 3262.6 records/sec (31.86 MB/sec), 631.0 ms avg latency, 886.0 ms max latency.
18086 records sent, 3616.5 records/sec (35.32 MB/sec), 571.7 ms avg latency, 824.0 ms max latency.
18531 records sent, 3706.2 records/sec (36.19 MB/sec), 551.9 ms avg latency, 762.0 ms max latency.
17768 records sent, 3553.6 records/sec (34.70 MB/sec), 583.7 ms avg latency, 891.0 ms max latency.
100000 records sent, 2378.3 records/sec (23.23 MB/sec), 822.42 ms avg latency, 2948.00 ms max latency, 615 ms 50th, 2122 ms 95th, 2803 ms 99th, 2922 ms 99.9th.