strimzi-demo-copia/src/infra/perf-results/04-producer-latency-test.txt
44281 records sent, 8856.2 records/sec (8.65 MB/sec), 1330.5 ms avg latency, 1915.0 ms max latency.
55651 records sent, 11108.0 records/sec (10.85 MB/sec), 190.3 ms avg latency, 596.0 ms max latency.
100000 records sent, 9870.7 records/sec (9.64 MB/sec), 695.10 ms avg latency, 1915.00 ms max latency, 443 ms 50th, 1810 ms 95th, 1887 ms 99th, 1908 ms 99.9th.