strimzi-demo-copia/src/infra/perf-results/06-producer-compression-test.txt
31371 records sent, 6274.2 records/sec (6.13 MB/sec), 439.5 ms avg latency, 704.0 ms max latency.
41757 records sent, 8351.4 records/sec (8.16 MB/sec), 1085.2 ms avg latency, 1954.0 ms max latency.
60236 records sent, 12044.8 records/sec (11.76 MB/sec), 1263.5 ms avg latency, 2185.0 ms max latency.
200000 records sent, 10550.7 records/sec (10.30 MB/sec), 1035.16 ms avg latency, 2185.00 ms max latency, 1038 ms 50th, 1839 ms 95th, 2141 ms 99th, 2178 ms 99.9th.